---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
source: html/5cfcad3c-345d-19eb-37bb-8783f6d890ba.htm
---
# StructuralSectionGeneralU Members

Creates a new instance of general Channel shape.